# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

def bun():
    print('булочку')


def cutlet():
    print("котлету")


def cucumber():
    print("огурец")


def tomato():
    print("помидор")


def mayo():
    print("майонез")


def cheese():
    print("сыр")
